.config/doom/doom-config.org
#+TITLE: THE DOOM CONFIG
#+SUBTITLE: All my Doom Emacs Configuration Files
#+AUTHOR: Cristian D. Moreno - Kyonax
#+DATE: 2025-02-12
#+auto_tangle: t
#+LAST_UPDATE: Feb 12, 2025
#+VERSION: v0.1

This ain't an average doom-config file, this is the master index of my entire Doom Emacs setup. Just one file, locked on generating the necessary tweaks to maintain my setup across all OS. My master file, jacked to fit my pesonal needs. Use it as your blueprint, but don't even think about PRs.

* TABLE OF CONTENTs :toc:
- [[#main][MAIN]]
  - [[#os-prober][OS PROBER]]
- [[#config-files][CONFIG FILEs]]
  - [[#packagesel][packages.el]]
  - [[#configel][config.el]]
- [[#binaries][BINARIES]]
  - [[#emacs-client-no-eval][emacs-client-no-eval]]
  - [[#emacs-client][emacs-client]]
  - [[#emacs-daemon-create][emacs-daemon-create]]
  - [[#emacs-daemon-startup][emacs-daemon-startup]]
  - [[#emacs-kill][emacs-kill]]

* MAIN
This file's wired into ~org-mode~ and ~org-babel~, to follow the idea of Literate Programming (in my case for configuration files), that's why is necessary a section to configure all the necessary stuff to make the Master File do magick.

** OS PROBER
One-File for All-OS, my main directive was to create a single file to tangle everything, no matter the OS I'm into. This OS PROBER section is locked on deploying ~org-babel~ and nailing down which blocks get tangled, all hinging on the data pulled from the =get-os-variable= block.

Call the function in a condition when creating the ~:tangle~ property in blocks, to identify if the block will be tangled depending on the OS.

#+NAME: get-os-type
#+begin_src emacs-lisp :tangle no :exports results :results value
(cond ((eq system-type 'gnu/linux)   "linux")
      ((eq system-type 'darwin)      "mac")
      ((eq system-type 'windows-nt)  "windows")
      ((eq system-type 'cygwin)      "cygwin")
      (t "unknown"))
#+end_src

Example of Usage:
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "os") "config.el" "no")
(message "Hello There I'm on Windows")
#+end_src

* CONFIG FILEs
** packages.el
Doom comes with the Default package manager for Doom Emacs, where all the packages will be installed when the command ~doom sync~ is run by the user.

Default File Documentation:
#+begin_src emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;; (package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/radian-software/straight.el#the-recipe-format
;; (package! another-package
;;   :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;; (package! this-package
;;   :recipe (:host github :repo "username/repo"
;;            :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;; (package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;; (package! builtin-package :recipe (:nonrecursive t))
;; (package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see radian-software/straight.el#279)
;; (package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;; (package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;; (unpin! pinned-package)
;; ...or multiple packages
;; (unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;; (unpin! t)
#+end_src

*** BEACON
#+begin_src emacs-lisp :tangle packages.el
(package! beacon)
#+end_src

*** CLIPPY
#+begin_src emacs-lisp :tangle packages.el
(package! clippy)
#+end_src

*** COMPANY-TABNINE
#+begin_src emacs-lisp :tangle packages.el
(package! company-tabnine)
#+end_src

*** DIRED-OPEN
#+begin_src emacs-lisp :tangle packages.el
(package! dired-open)
#+end_src

*** DIRED-SUBTREE
#+begin_src emacs-lisp :tangle packages.el
(package! dired-subtree)
#+end_src

*** ELFEEDED-GOODIES
#+begin_src emacs-lisp :tangle packages.el
(package! elfeed-goodies)
#+end_src

*** EMOJIFY
#+begin_src emacs-lisp :tangle packages.el
(package! emojify)
#+end_src

*** EVIL-TUTOR
#+begin_src emacs-lisp :tangle packages.el
(package! evil-tutor)
#+end_src

*** FLX
#+begin_src emacs-lisp :tangle packages.el
(package! flx)
#+end_src

*** GPTEL
#+begin_src emacs-lisp :tangle packages.el
(package! gptel)
#+end_src

*** IVY-POSFRAME
#+begin_src emacs-lisp :tangle packages.el
(package! ivy-posframe)
#+end_src

*** IVY-PRESCIENT
#+begin_src emacs-lisp :tangle packages.el
(package! ivy-prescient)
#+end_src

*** OLIVETTI
#+begin_src emacs-lisp :tangle packages.el
(package! olivetti)
#+end_src

*** ORG-AUTO-TANGLE
#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle)
#+end_src

*** ORG-BULLETS
#+begin_src emacs-lisp :tangle packages.el
(package! org-bullets)
#+end_src

*** ORG-WEB-TOOLS
#+begin_src emacs-lisp :tangle packages.el
(package! org-web-tools)
#+end_src

*** PASSWORD-STORE
#+begin_src emacs-lisp :tangle packages.el
(package! password-store)
#+end_src

*** PEEP-DIRED
#+begin_src emacs-lisp :tangle packages.el
(package! peep-dired)
#+end_src

*** RAINBOW-MODE
#+begin_src emacs-lisp :tangle packages.el
(package! rainbow-mode)
#+end_src

*** RESIZE-WINDOW
#+begin_src emacs-lisp :tangle packages.el
(package! resize-window)
#+end_src

*** TLDR
#+begin_src emacs-lisp :tangle packages.el
(package! tldr)
#+end_src

*** WC-MODE
#+begin_src emacs-lisp :tangle packages.el
(package! wc-mode)
#+end_src

*** WEB-MODE
#+begin_src emacs-lisp :tangle packages.el
(package! web-mode)
#+end_src

*** ORG-ROAM-UI
#+begin_src emacs-lisp :tangle packages.el
(unpin! org-roam company-org-roam)
(package! org-roam-ui)
#+end_src
** config.el
*** EDITOR DEFAULTs
**** BEACON PACKAGE
Setup the ~beacon~ package to never lose the cursor. Shiny cursor interaction when moving.
#+begin_src emacs-lisp :tangle config.el
(use-package beacon
  :config
  (beacon-mode 1))
#+end_src

**** BOOKMARKs
Setup the ~bookmarks~ for the editor.

- *Keybindings Bookmarks*
| COMMAND         | DESCRIPTION                            | KEYBINDING |
|-----------------+----------------------------------------+------------|
| list-bookmarks  | /List bookmarks/                         | SPC b L    |
| bookmark-set    | /Set bookmark/                           | SPC b m    |
| bookmark-delete | /Delete bookmark/                        | SPC b M    |
| bookmark-save   | /Save current bookmark to bookmark file/ | SPC b w    |

#+begin_src emacs-lisp :tangle config.el
(setq bookmark-default-file "~/.brain.d/bookmarks/bookmarks")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+end_src

**** EDITORCONFIG PACKAGE
Enable the usage of ~editorconfig~ package. Consistency while develop [[https://github.com/editorconfig/editorconfig-emacs#readme][Read More]].
#+begin_src emacs-lisp :tangle config.el
(use-package editorconfig
  :ensure t
  :config
  (editorconfig-mode 1))
#+end_src

**** FILE CODING SYSTEM
Set the File Coding System always to unix, this configuration is tweaked to maintain consistency across OS, used just on ~windows~ setup.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(set-buffer-file-coding-system 'unix)
#+end_src

**** FONTs
Set the default fonts used across Emacs. There is just one font used right now in my Config:
- *Space Mono Nerd Font* [[https://www.nerdfonts.com/font-downloads][Nerd Fonts Website]].
#+begin_src emacs-lisp :tangle config.el
(setq doom-font (font-spec :family "SpaceMono Nerd Font Mono" :size 11)
      doom-variable-pitch-font (font-spec :family "SpaceMono Nerd Font Mono" :size 11)
      doom-big-font (font-spec :family "SpaceMono Nerd Font Mono" :size 18))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

**** TRUNCATE LINEs
Set a toggle keymap for ~truncated lines~, this is a toggle function.
#+begin_src emacs-lisp :tangle config.el
(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)
#+end_src

**** MELPA
Configure Melpa and enable the ~MELPA Stable~ packages repo. Comment the Stable configuration if not necessary the Stable version.
#+begin_src emacs-lisp :tangle config.el
(use-package package
  :config
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize))
#+end_src

**** MODELINE PACKAGE
Setup the ~modeline~ package, this is the bottom status bar that appears in Emacs Windows. The Configuration is based on personal preferences to more information [[https://github.com/seagle0128/doom-modeline][Read More]].
#+begin_src emacs-lisp :tangle config.el
(use-package doom-modeline
  :config
  (set-face-attribute 'mode-line nil :font "SpaceMono Nerd Font Mono")
  (setq doom-modeline-support-imenu t
      doom-modeline-buffer-state-icon t
      doom-modeline-icon t
      doom-modeline-height 33
      doom-modeline-bar-width 6
      doom-modeline-persp-name t
      doom-modeline-persp-icon t))
#+end_src

**** SERVER SOCKET
Generate the ~server-socket~ on a specific location. Daemon performance requirements.
#+begin_src emacs-lisp :tangle config.el
(use-package server
  :config
  (setq server-use-tcp t
      server-socket-dir "~/.config/emacs/server"))
#+end_src

**** SHELL FOR COMPILATION
Setup the default ~shell~ to use for compilation. Create a toggle function for Windows to use Cygwin.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(defun kyo/toggle-shell-cygwin ()
  "Toggle between PowerShell and Cygwin as the default shell."
  (interactive)
  (if (string= shell-file-name "~/scoop/apps/pwsh/7.5.0/pwsh.exe")
      (setq shell-file-name "C:/cygwin/bin/bash.exe")
    (setq shell-file-name "~/scoop/apps/pwsh/7.5.0/pwsh.exe"))
  (message "Shell toggled to: %s" shell-file-name))

(setq shell-file-name "~/scoop/apps/pwsh/7.5.0/pwsh.exe")

(map! :leader
      :desc "Toggle Shells between PowerShell and Cygwin."
      "t h" #'kyo/toggle-shell-cygwin)
#+end_src

