.config/doom/config.el
(use-package beacon
  :config
  (beacon-mode 1))

(setq bookmark-default-file "~/.brain.d/bookmarks/bookmarks")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))

(use-package editorconfig
  :ensure t
  :config
  (editorconfig-mode 1))

(setq doom-font (font-spec :family "SpaceMono Nerd Font Mono" :size 11)
      doom-variable-pitch-font (font-spec :family "SpaceMono Nerd Font Mono" :size 11)
      doom-big-font (font-spec :family "SpaceMono Nerd Font Mono" :size 18))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)

(use-package package
  :config
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize))

(use-package doom-modeline
  :config
  (set-face-attribute 'mode-line nil :font "SpaceMono Nerd Font Mono")
  (setq doom-modeline-support-imenu t
      doom-modeline-buffer-state-icon t
      doom-modeline-icon t
      doom-modeline-height 33
      doom-modeline-bar-width 6
      doom-modeline-persp-name t
      doom-modeline-persp-icon t))

(use-package server
  :config
  (setq server-use-tcp t
      server-socket-dir "~/.config/emacs/server"))
