.config/doom/doom-config.org
***** AUTO-TANGLE
Setup the ~org-auto-tangle~ to Org Files when the document is saved, this functionality works when the ~#+auto_tangle: t~ option is set at the top of the file.
#+begin_src emacs-lisp :tangle config.el
(defun kyo/tangle-on-save ()
  "If the current Org buffer has the auto_tangle tag, execute all code blocks and tangle the file."
  (when (and (derived-mode-p 'org-mode)
             ;; Check for the #+auto_tangle: t tag in the file
             (save-excursion
               (goto-char (point-min))
               (re-search-forward "^#\\+auto_tangle:[ \t]*t" nil t)))
    (org-babel-tangle)))

;; Add kyo/tangle-on-save to the after-save-hook for Org mode buffers only.
(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'after-save-hook #'kyo/tangle-on-save nil t)))

(defun kyo/insert-auto-tangle-tag ()
  "Insert auto-tangle tag in a literate config."
  (interactive)
  (evil-org-open-below 1)
  (insert "#+auto_tangle: t ")
  (evil-force-normal-state))

(map! :leader
      :desc "Insert auto_tangle tag" "i a" #'kyo/insert-auto-tangle-tag)
#+end_src
***** BABEL
Setup the ~org-babel-languages~ to evaluate all this languages from the org code blocks.
#+begin_src emacs-lisp :tangle config.el
(org-babel-do-load-languages
 'org-babel-load-languages
 '((typescript . t)
   (javascript . t)
   (emacs-lisp . t)
   (js . t)
   (json . t)
   (php . t)
   ))

(setq org-babel-command:typescript "npx -p typescript -- tsc")
(setq org-confirm-babel-evaluate nil)
#+end_src

***** FANCY PRIORITIEs
Setup the ~org-fancy-priorities~ package to stylize the priorities of the Org Files.
#+begin_src emacs-lisp :tangle config.el
(use-package org-fancy-priorities
  :ensure t
  :hook
  (org-mode . org-fancy-priorities-mode)
  :config
  (setq org-fancy-priorities-list '("" "󱡞" "󰝨")
   org-priority-faces
   '((?A :foreground "#ff6c6b" :weight regular)
     (?B :foreground "#98be65" :weight regular)
     (?C :foreground "#c678dd" :weight regular))))
#+end_src
***** ROAM
Setup the ~org-roam~ package to use the ~brain~ notes.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(defvar my-org-roam-capture-templates
  '(
    ("d" "default" plain "%?"
     :if-new (file+head "%<%Y-%m-%d-$S>-${slug}.org"
                        "#+title: ${title}\n")
     :unnarrowed t)
    ("s" "Not Time Stamp File" plain "%?"
     :if-new (file+head "${slug}.org"
                        "#+title: ${title}\n")
     :unnarrowed t)
    ("f" "New Feature Azure DevOps" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeTemplate.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: ${title}\n#+DESCRIPTION: %^{Description}\n#+FILETAGS: %^{File Tags}\n#+AUTHOR: %^{Author}\n")
     :unnarrowed t)
    ("i" "New Sentinel Inspection" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeSentinelInspection.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: Kyonax's Daily Sentinel Inspection ~ %<%d/%m/%Y> \n")
     :unnarrowed t)
    ("p" "New PBI Azure DevOps" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeProject.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: ${title}\n#+DESCRIPTION: %^{Description}\n#+FILETAGS: %^{File Tags}\n#+AUTHOR: %^{Author}\n")
     :unnarrowed t))
  "My custom Org Roam capture templates for Windows/Work.")
#+end_src

#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "linux") "config.el" "no")
(defvar my-org-roam-capture-templates
  '(
    ("d" "default" plain "%?"
     :if-new (file+head "%<%Y-%m-%d-$S>-${slug}.org"
                        "#+title: ${title}\n")
     :unnarrowed t)
    ("s" "Not Time Stamp File" plain "%?"
     :if-new (file+head "${slug}.org"
                        "#+title: ${title}\n")
     :unnarrowed t)
    ("f" "New Feature Azure DevOps" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeTemplate.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: ${title}\n#+DESCRIPTION: %^{Description}\n#+FILETAGS: %^{File Tags}\n#+AUTHOR: %^{Author}\n")
     :unnarrowed t)
    ("i" "New Sentinel Inspection" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeSentinelInspection.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: Kyonax's Daily Sentinel Inspection ~ %<%d/%m/%Y> \n")
     :unnarrowed t)
    ("p" "New PBI Azure DevOps" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeProject.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: ${title}\n#+DESCRIPTION: %^{Description}\n#+FILETAGS: %^{File Tags}\n#+AUTHOR: %^{Author}\n")
     :unnarrowed t))
  "My custom Org Roam personal capture templates.")
#+end_src

#+begin_src emacs-lisp :tangle config.el
(after! org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (setq org-roam-directory "~/.brain.d/roam-nodes")
  (setq org-roam-dailies-directory "~/.brain.d/agenda")
  (setq org-roam-completion-everywhere t)
  (setq org-roam-capture-templates `,my-org-roam-capture-templates))
#+end_src

- *Keybindings Org Roam Dailies*
| COMMAND                            | DESCRIPTION                                 | KEYBINDING |
|------------------------------------+---------------------------------------------+------------|
| org-roam-dailies-capture-yesterday | /Create a daily roam node for Yesterday/      | SPC n D Y  |
| org-roam-dailies-capture-yesterday | /Create a daily roam node for Today/          | SPC n D H  |
| org-roam-dailies-capture-tomorrow  | /Create a daily roam node for Tomorrow/       | SPC n D T  |
| org-roam-dailies-capture-date      | /Create a daily roam node using Calendar/     | SPC n D C  |
| org-roam-dailies-goto-date         | /Find a daily roam node from a specific Date/ | SPC n e d  |

#+begin_src emacs-lisp :tangle config.el
(map! :leader
      (:prefix ("n D" . "Create Roam Nodes")
       :desc "Daily Nodes - Yesterday" "Y" #'org-roam-dailies-capture-yesterday
       :desc "Daily Nodes - Today" "H" #'org-roam-dailies-capture-today
       :desc "Daily Nodes - Calendar" "C" #'org-roam-dailies-capture-date
       :desc "Daily Nodes - Tomorrow" "T" #'org-roam-dailies-capture-tomorrow))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(map! :leader
      (:prefix ("n e" . "Find Roam Nodes")
       :desc "Daily Nodes - Date" "d" #'org-roam-dailies-goto-date
       :desc "Daily Nodes - Yesterday" "Y" #'org-roam-dailies-goto-yesterday
       :desc "Daily Nodes - Today" "H" #'org-roam-dailies-goto-today
       :desc "Daily Nodes - Tomorrow" "T" #'org-roam-dailies-goto-tomorrow))
#+end_src

- *Websocket Config:*
#+begin_src emacs-lisp :tangle config.el
(use-package! websocket
    :after org-roam)
(use-package! org-roam-ui
    :after org
    :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src
**** RAINBOW-MODE
Set the ~rainbow-mode~ package to displays the actual color for any hex value color.
#+begin_src emacs-lisp :tangle config.el
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda ()
    (when (not (memq major-mode
                (list 'org-agenda-mode)))
     (rainbow-mode 1))))
(global-rainbow-mode 1 )

(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
#+end_src

**** WEB-MODE
Setup the ~web-mode~ package to use it on all html template files.
#+begin_src emacs-lisp :tangle config.el
(defun kyo/web-mode-setup ()
  (setq web-mode-enable-current-element-highlight t)
  (setq web-mode-enable-current-column-highlight t)
  (setq web-mode-block-padding 2))

(use-package web-mode
  :mode (("\\.html\\'" . web-mode)
         ("\\.html\\.twig\\'" . web-mode))
  :hook (web-mode . kyo/web-mode-setup))
#+end_src

**** WHITESPACE-MODE
Setup the ~whitespace-mode~ package to use it on the main languages that I work with.
#+begin_src emacs-lisp :tangle config.el
(use-package whitespace-mode
  :hook ((js2-mode . whitespace-mode)
         (web-mode . whitespace-mode)
         (php-mode . whitespace-mode)))
#+end_src

*** USER DEFAULTs
#+begin_src emacs-lisp :tangle config.el
(setq user-full-name "Cristian D. Moreno - Kyonax"
      user-mail-address "iam@kyo.wtf")
#+end_src
*** CUSTOM PACKAGEs
**** EMACS TV
*EmacsTV* Project which I'm working on - [[https://github.com/emacstv/emacstv.github.io][Github Repo]].
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "linux") "config.el" "no")
(add-load-path! "~/Documents/emacstv.github.io-kyo/")
(require 'emacstv)
#+end_src

